backend/controllers/ActivityPosterController.php

SELECT * FROM `yl_activity_poster_3` WHERE `poster_id`=15
---
    public function actionView($id)
    {
       $model =  $this->findModel($id);
       if($model->category_id==1){
        $model_params =  ActivityPoster1::find()->where(['poster_id'=>$model->id])->one();
       }
       if($model->category_id==2){
        $model_params =  ActivityPoster2::find()->where(['poster_id'=>$model->id])->one();
       }
       if($model->category_id==3){
        $model_params =  ActivityPoster3::find()->where(['poster_id'=>$model->id])->one();

SELECT * FROM `yl_activity_poster` WHERE `id`='15'
---
    protected function findModel($id)
    {
        if (($model = ActivityPoster::findOne($id)) !== null) {