backend/controllers/ActivitiesController.php

    protected function findModel($id)
    {
        if (($model = Activities::findOne($id)) !== null) {
---
SELECT * FROM `yl_activities` WHERE `id`='2'