backend/controllers/AdminLogController.php

    protected function findModel($id)
    {
        if (($model = AdminLog::findOne($id)) !== null) {
---
SELECT * FROM `yl_admin_log` WHERE `id`='447'