backend/controllers/RoleController.php

    public function actionAuth($id) {
        $authManager = Yii::$app->authManager;
        if(Yii::$app->request->isPost) {
            $rules = Yii::$app->request->post('rules', []);
            if(!$role = $authManager->getRole($id)) {
                Yii::$app->session->setFlash('error', '角色不存在');
            }
            //删除角色所有child
            $authManager->removeChildren($role);
            //print_r($rules);die;
            foreach ($rules as $rule) {
                //auth_rule表
                $ruleModel = new AuthRule();
                $ruleModel->name = $rule;
                $ruleModel->save();
                //auth_item表
                $itemModel = new AuthItem($authManager->getPermission($rule));
                $itemModel->name = $rule;
                $itemModel->type = Item::TYPE_PERMISSION;
                $itemModel->ruleName = $rule;
                $itemModel->save();
                //auth_item_child表
                if(!$authManager->hasChild($role, $itemModel)) {
                    $authManager->addChild($role, $itemModel);
                }
            }
            Yii::$app->session->setFlash('success', '操作成功');
        }
        $arr = Menu::find()->asArray()->all();
---
SELECT * FROM `yl_menu`