mobile/controllers/ActivityController.php

SELECT * FROM `yl_activities` WHERE `id`='1'
---
   protected function findModel($id)
    {
        if (($model = Activities::findOne($id)) !== null) {