mobile/controllers/ActivityController.php

SELECT * FROM `yl_activity_poster` WHERE `id`='12'
---
     public function actionMaintiezhiposter()
    {
       $this->layout = false;
        $request = Yii::$app->request;
         /*活动状态信息*/
        $activity_status =$this->GetActivityStatus();
       if($activity_status['code'])return $this->msgerror($activity_status['msg']);
        $poster_id = Yii::$app->request->get('poster_id');
        $poster = ActivityPoster::findOne($poster_id);

SELECT * FROM `yl_activities` WHERE `id`='1'
---
   protected function findModel($id)
    {
        if (($model = Activities::findOne($id)) !== null) {