mobile/models/Config.php

    public static function getConfigs($keyid) {
        $configs = self::find()->where(['keyid' => $keyid])->asArray()->one();
---
SELECT * FROM `yl_config` WHERE `keyid`='basic'