mobile/models/UploadFiles.php

SELECT * FROM `yl_upload_files` WHERE `id`='17'
---
     public static function findimage($id)
    {
        $result = static::findOne(['id' => $id]);