common/models/Category.php

SELECT * FROM `yl_category` WHERE `display`=1
---
    public static function getCategory() {
        $menus = static::find()->where(['display' => 1])->asArray()->all();