backend/models/Activities.php

    public static function getname($id){
        $result = static::findOne($id);
---
SELECT * FROM `yl_activities` WHERE `id`=2