backend/models/Admin.php

    public static function findIdentity($id) {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `yl_admin` WHERE (`id`='2') AND (`status`=1)