backend/models/AuthAssignment.php

    public static function getUserrole($id)
    {
        $AuthAssignmentModel = new AuthAssignment();
        $role = $AuthAssignmentModel::find()->where(['user_id' => $id])->asArray()->one();
---
SELECT * FROM `yl_auth_assignment` WHERE `user_id`='2'