backend/models/Backgroundimage.php

SELECT * FROM `yl_backgroundimage` WHERE `id`=1
---
     public static function findimage($id)
    {
        $result = static::findOne(['id' => $id]);