backend/models/Category.php

    public static function getCategoryname($id){
        $result = static::findOne($id);
---
SELECT * FROM `yl_category` WHERE `id`=3