backend/models/Config.php

SELECT * FROM `yl_config` WHERE `keyid`='basic'
---
    public static function getConfigs($keyid) {
        $configs = self::find()->where(['keyid' => $keyid])->asArray()->one();