backend/models/Menu.php

    public static function getMenu() {
        $menus = static::find()->where(['display' => 1])->asArray()->orderby('sort asc')->all();
---
SELECT * FROM `yl_menu` WHERE `display`=1 ORDER BY `sort`