backend/models/UploadFiles.php

     public static function findimage($id)
    {
        $result = static::findOne(['id' => $id]);
---
SELECT * FROM `yl_upload_files` WHERE `id`='20'